tutorials/multiphase/multiphaseEulerFoam/RAS/wallBoiling/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       120.914;
    }
    equationOfState
    {
        rho        1017.1;
    }
    thermodynamics
    {
        Hf          0;
        Cv          1394.5;
        Tref        359.981;
        Esref       290090;
    }
    transport
    {
        mu          8.9e-5;
        Pr          2.8;
    }
}
// ************************************************************************* //
